#### BuiltInFailures.DisplacementElementFailures Members

---

|  |
| --- |
| BuiltInFailures DisplacementElementFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DisplacementElementFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCopyDisplacementSetIntoOtherDocument | A Displacement Set can only be pasted into a view in the same document in which it was created. |
| Public property Static member | CannotRemoveLastDisplacedElement | A Displacement Set can only be pasted into a view in the same document in which it was created. |
| Public property Static member | DetectedCycleInDisplacedElementParents | Invalid parent relationship for a Displacement element. No cycles are allowed. |
| Public property Static member | ElementsAlreadyDisplacedInView | You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set. |

# See Also

BuiltInFailures DisplacementElementFailures Class

Autodesk.Revit.DB Namespace